# **Codig Dojo**: Titanic
## Creado por: Alejandro Acosta

- Fecha de creación: 2022-01-16
- Fecha de modificación: 2022-01-16
- Descripción: Ejercicio Titanic

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('titanic.csv', header=0)

In [5]:
# Muestra la cabecera de la trama de datos
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# ¿Cuál es el porcentaje de personas que sobrevivió? (pista: encuentra la media de la columna de supervivencia)
df.Survived.mean()

0.3838383838383838

In [8]:
# ¿Cuántos de cada sexo sobrevivieron?
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [9]:
# ¿Cuál es el porcentaje de gente que sobrevivió que pagó un pasaje de menos de 10?
df[df['Fare']<10]['Survived'].mean()

0.19940476190476192

In [10]:
# ¿Cuál es la edad promedio de quienes no sobrevivieron?
df[df.Survived==0]['Age'].mean()

30.62617924528302

In [11]:
# ¿Cuál es la edad promedio de quienes sobrevivieron?
df[df.Survived==1]['Age'].mean()

28.343689655172415

In [12]:
# ¿Cuál es la edad promedio de quienes sobrevivieron y no sobrevivieron agrupados por sexo?
df.pivot_table(index = 'Survived', columns = 'Sex', aggfunc={'Age':'mean'})

                Age
Sex          female       male
Survived
0         25.046875  31.618056
1         28.847716  27.276022